import React, { Component } from 'react';
import ColorChangingElement from './ColorChangingElement';
import Image from './Image';

class Content extends Component {
  render() {
    return (
    <div>
        <h2>Колєснік Володимир Валерійович</h2>
        <p>Місце нарождження: смт. Велика Багачка, 19 квітня 2006 року</p>
        <p>Освіта:</p>
        <p style={{ textIndent: '50px' }}>ОЗ "Великобагачанський ЗЗСО I-III ступенів";</p>
        <p style={{ textIndent: '50px' }}>НТУУ "Київський політехнічний інститут імені Ігоря Сікорського", м. Київ
        </p>
        
        <p>Хоббі:</p>
        <ul>
            <li>Комп'ютерні ігри</li>
            <li>Подорожі</li>
            <ColorChangingElement>
                <li>Риболовля</li>
            </ColorChangingElement>
        </ul>
        <ColorChangingElement>
            <p>Улюблені фільми:</p>
        </ColorChangingElement>
        <ol>
            <li>Дуже страшне кіно 1</li>
            <li>Зоряні війни: Імперія завдає удару у відповідь</li>
            <li>Назад у майбутнє</li>
        </ol>

        <p>
            Прага — столиця та найбільше місто Чехії, 
            адміністративний центр Середньочеського краю та Праги як окремого регіона, 
            <br />а також двох районів Середньочеського краю Прага-Захід та Прага-Схід.
            Прага розташована в західній частині Чехії, в історичній області Богемія.
        </p>

        <p>
            Офіційними символами Праги є прапор та герб. 
            <br />Прапор Праги являє собою прямокутне полотнище зі співвідношенням сторін 2:3, воно складається з двох рівновеликих горизонтальних смуг червоного і жовтого кольорів. 
            <br />Прапор іноді використовується з розміщеним на ньому гербом Праги. Герб має геральдичний щит іспанської форми і пофарбований в пурпурний колір. У центрі щита зображена кам'яна фортеця з двостулковими воротами та трьома вежами. Ворота на фортеці розкриті, решітка піднята. 
            <br />У воротах видно руку, закуту в срібні лицарські лати і стискаюча меч.
        </p>

        <Image />
    </div>
    );
  }
}

export default Content;